# ----------------------------------- https://github.com/m4mallu/gofilesbot ------------------------------------------ #

class Presets(object):
    
    CAPTION_TEXT_DOC = "<b>Hey 👋 {} 😍</b>/n/n<code>{}</code>\n\n⚠️  കോപ്പി റൈറ്റ് ഉള്ളത് കൊണ്ട് ഈ ഒരു ഫയൽ 2 മിനിറ്റ് കൊണ്ട് ഇവിടെ നിന്നും ഡിലേറ്റാവും...!!!\n\nഇവിടെ നിന്നും വേറെ എവിടേലും മാറ്റിയതിന് ശേഷം ഡൗൺലോഡ് ചെയ്യുക...!!!\n\n<b>♻️ 𝙅𝙊𝙄𝙉 :- https://t.me/joinchat/Ur8bdKHGNRdBoeHW</b>"
    
    
    CAPTION_TEXT_VID = "<b>Hey 👋 {} 😍</b>/n/n<code>{}</code>\n\n⚠️  കോപ്പി റൈറ്റ് ഉള്ളത് കൊണ്ട് ഈ ഒരു ഫയൽ 2 മിനിറ്റ് കൊണ്ട് ഇവിടെ നിന്നും ഡിലേറ്റാവും...!!!\n\nഇവിടെ നിന്നും വേറെ എവിടേലും മാറ്റിയതിന് ശേഷം ഡൗൺലോഡ് ചെയ്യുക...!!!\n\n<b>♻️ 𝙅𝙊𝙄𝙉 :- https://t.me/joinchat/Ur8bdKHGNRdBoeHW</b>"
    
    
    ASK_PM_TEXT = "<b>Cʟɪᴄᴋ Tʜᴇ Bᴇʟᴏᴡ Bᴜᴛᴛᴏɴ</b>"
    
    
    CLEAN_CHAT_MSG = "⚠️ <b>Dᴇʟᴇᴛɪɴɢ ᴀʟʟ ᴍᴇssᴀɢᴇs..</b>"
    
    
    MSG_FOR_PIN = "<b>Fᴏʀ ɢᴇᴛᴛɪɴɢ ᴍᴇᴅɪᴀs ғʀᴏᴍ ʜᴇʀᴇ..</b>\n\n🔛 <code>Pʟᴇᴀsᴇ sᴛᴀʀᴛ</code> @{} <code>ɪɴ PM\n\n" \
                  "Sᴇɴᴅ ᴛʜᴇ ᴇxᴀᴄᴛ Mᴏᴠɪᴇ ɴᴀᴍᴇ.\n\n🔊 I'ʟʟ ʀᴇᴘʟʏ ᴛʜᴇ ғɪʟᴇ ɪɴ PM ɪғ ᴀᴠᴀɪʟᴀʙʟᴇ ɪɴ ᴏᴜʀ ᴄʜᴀɴɴᴇʟ !</code>"

    
    BOT_PM_TEXT = "<b>Sᴏʀʀʏ.. 😢</b>\n\n<code>Bᴏᴛ ᴡᴏɴ'ᴛ ᴡᴏʀᴋ ɪɴ PM, Asᴋ ɪɴ ᴍᴀ Gʀᴏᴜᴘ. I'ʟʟ ʀᴇᴘʟʏ ᴛʜᴇ ғɪʟᴇ ɪɴ PM ɪғ " \
                  "ᴀᴠᴀɪʟᴀʙʟᴇ ɪɴ ᴏᴜʀ DB !</code>"
    
    
    PM_ERROR = "<b>Uɴᴀʙʟᴇ ᴛᴏ sᴇɴᴅ ᴍᴇᴅɪᴀs</b> ⛔️\n<code>Cʟɪᴄᴋ ᴛʜᴇ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴ\nAsᴋ ʜᴇʀᴇ ғᴏʀ ᴍᴏᴠɪᴇs ʟᴀᴛᴇʀ!</code>"
    
    
    MEDIA_SEND_TEXT = "<code>{} Files Sended In Your PM 🥳</code>"
    
    
    NO_MEDIA = """<b>Couldn't Find {} Movie ? Please Click MUST READ Button Below..!!\n\n{} മൂവി കിട്ടിയില്ല അല്ലെ ? താഴെ ഉള്ള ബട്ടനിൽ ക്ലിക്ക് ചെയി..!!</b>"""
    
    
    BLOCK_LIST = ['http://', 'https://', '@', '#', 'bit.ly', 't.me', '/']
    
    
    
    #Added By @OwDvEr!
    
    START_TXT = """<b>Hᴇʟᴏ {},\nMʏ Nᴀᴍᴇ Is <a href='https://t.me/OB_FILTERROBOT'>Tᴏᴍ Hɪᴅᴅʟᴇsᴛᴏɴ</a>, I Cᴀɴ Pʀᴏᴠɪᴅᴇ Mᴏᴠɪᴇs, Jᴜsᴛ Aᴅᴅ Mᴇ Tᴏ Yᴏᴜʀ Gʀᴏᴜᴘ Aɴᴅ Eɴᴊᴏʏ 😍</b>"""
    
    
    HELP_TXT = """<b>Hey {},\nHᴇʀᴇ Is Tʜᴇ Hᴇʟᴘ Fᴏʀ Usɪɴɢ Tʜɪs Bᴏᴛ</b>\n\n<i>- Bᴏᴛ Bᴜᴛᴛᴏɴ Fᴏʀ Hᴏᴡ ᴛᴏ Usᴇ Tʜɪs Bᴏᴛ\n-Gʀᴏᴜᴘ Bᴜᴛᴛᴏɴ Fᴏʀ Hᴏᴡ Tᴏ Cᴏɴɴᴇᴄᴛ Tʜɪs Bᴏᴛ Aɴᴅ Yᴏᴜʀ Gʀᴏᴜᴘ\n- Cʜᴀɴɴᴇʟ Bᴜᴛᴛᴏɴ Fᴏʀ Hᴏᴡ Tᴏ Aᴅᴅ Yᴏᴜʀ Cʜᴀɴɴᴇʟ Tᴏ Dᴀᴛᴀʙᴀsᴇ</i>"""
    
    
    ABOUT_TXT ="""<b>✯ Mʏ Nᴀᴍᴇ: Tᴏᴍ Hɪᴅᴅʟᴇsᴛᴏɴ\n✯ Cʀᴇᴀᴛᴏʀ: Oᴡᴅᴠᴇʀ Bᴏᴛ\n✯ Lɪʙʀᴀʀʏ: Pʏʀᴏɢʀᴀᴍ\n✯ Lᴀɴɢᴜᴀɢᴇ: Pʏᴛʜᴏɴ 3\n✯ Bᴏᴛ Sᴇʀᴠᴇʀ: Hᴇʀᴏᴋᴜ\n✯ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: ᴠ1.0.6 [ Bᴇᴛᴀ ]</b>"""

    
    SOURCE_TXT = """<b>Nᴏᴛᴇ:</b>\n- Tᴏᴍ Hɪᴅᴅʟᴇsᴛᴏɴ Is ᴀ Cʟᴏɴᴇ Oғ ᴍ4ᴍᴀʟʟᴜ's GᴏFɪʟᴇsBᴏᴛ\n- Sᴏᴜʀᴄᴇ - https://github.com/m4mallu/gofilesbot \n\nUᴘᴅᴀᴛᴇ Cʜᴀɴɴᴇʟ - @OB_LINKS"""
    
    
    HOWTO_USE = """- Jᴜsᴛ Gᴏ Tᴏ A Gʀᴏᴜᴘ Wʜᴇʀᴇ ᴀᴍ Exɪsᴛ\n  (Oғғɪᴄɪᴀʟ Gʀᴏᴜᴘ @OB_MG)\n- Asᴋ A Mᴏᴠɪᴇ Iɴ Fᴏʀᴍᴀᴛ Tᴏ Kɴᴏᴡ Mᴏʀᴇ Cʟɪᴄᴋ Fᴏʀᴍᴀᴛ Bᴜᴛᴛᴏɴ\n- Tʜᴇɴ Bᴏᴛ Wɪʟʟ Sᴇɴᴅ Tʜᴇ Fɪʟᴇs Hᴇʀᴇ"""

    
    FORMAT = """<b>Tʜɪɴɢs ᴛᴏ ʟᴏᴏᴋ ᴏᴜᴛ ғᴏʀ ᴡʜᴇɴ ᴀsᴋɪɴɢ ғᴏʀ ᴀ ᴍᴏᴠɪᴇ ɪɴ ᴍʏ ɢʀᴏᴜᴘ 👇</b><i>\n\n<b>1.</b> Asᴋɪɴɢ ғᴏʀ ᴀɴ ᴜɴʀᴇʟᴇᴀsᴇᴅ ᴏʀ ᴘʀᴇᴅᴠᴅ (HQRɪᴘ, Cᴀᴍʀɪᴘ, DVDSᴄʀ) ᴍᴏᴠɪᴇ ɪs sᴛʀɪᴄᴛʟʏ ᴘʀᴏʜɪʙɪᴛᴇᴅ \n<b>2.</b> Nᴇᴠᴇʀ sᴇɴᴅ Pʟᴇᴀsᴇ, Sᴇɴᴅ, Kɪᴛᴛᴜᴍᴏ, Uɴᴅᴏ...ᴇᴛᴄ ᴡʜɪʟᴇ ʀᴇᴏ̨ᴜᴇsᴛɪɴɢ ᴀ ᴍᴏᴠɪᴇ\n<b>3.</b> Asᴋ ᴍᴏᴠɪᴇs ɪɴ ᴄᴏʀʀᴇᴄᴛ sᴘᴇʟʟɪɴɢ\n<b>4.</b> Iғ ʏᴏᴜ ʜᴀᴠᴇ ɴᴏᴛ ʀᴇᴄᴇɪᴠᴇᴅ ᴛʜᴇ ᴍᴏᴠɪᴇ ʙʏ sᴇɴᴅɪɴɢ ᴛʜᴇ ᴄᴏʀʀᴇᴄᴛ sᴘᴇʟʟɪɴɢ, sᴇɴᴅ ɪᴛ ᴀɢᴀɪɴ ᴡɪᴛʜ ᴛʜᴇ ʏᴇᴀʀ \ɴ<ʙ>Eɢ: Kᴜʀᴜᴛʜɪ (2021) ᴏʀ Kᴜʀᴜᴛʜɪ 2021</b></i>"""
    
    
    CHANNEL = """<b>Hᴏᴡ Tᴏ Aᴅᴅ Yᴏᴜʀ Cʜᴀɴɴᴇʟ Fɪʟᴇs Tᴏ Tʜɪs Bᴏᴛ</b>\n\n1. <i>- Aᴅᴅ Tʜɪs Bᴏᴛ Tᴏ Yᴏᴜʀ Cʜᴀɴɴᴇʟ As Aᴅᴍɪɴ</i>\n2. <i>- Sᴇɴᴅ Yᴏᴜʀ Cʜᴀɴɴᴇʟ Usᴇʀɴᴀᴍᴇ ᴏʀ Iɴᴠɪᴛᴇ Lɪɴᴋ ɪɴ @OᴡDᴠEʀ_BᴏT</i>\n<b>ᴇ.ɢ:</b><code>Mʏ Cʜᴀɴɴᴇʟ Usᴇʀɴᴀᴍᴇ: @OB_BACKUPGROUND \nAᴅᴅ ᴛʜɪs ᴛᴏ ʏᴏᴜʀ @OB_ANYFILTERBOT Dᴀᴛᴀʙᴀsᴇ</code>"""

    
    GROUP = """<b>Hᴏᴡ ᴛᴏ Cᴏɴɴᴇᴄᴛ ᴛʜɪs Bᴏᴛ & ʏᴏᴜʀ Gʀᴏᴜᴘ</b>\n\- Aᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ Gʀᴏᴜᴘ & ᴀɴᴅ ᴍᴀᴋᴇ ᴍᴇ Aᴅᴍɪɴ\n\n Tʜᴀᴛs ᴀʟʟ :)"""
    
    
